In [155]:
import pandas as pd
import numpy as np

In [156]:
df = pd.read_csv("Bengaluru_House_Data.csv")
df.drop(["availability", "society", "balcony"], axis = 1, inplace = True)
df.head()

,area_type,location,size,total_sqft,bath,price
0,Super built-up Area,Electronic City Phase II,2 BHK,1056,2.0,39.07
1,Plot Area,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00
2,Built-up Area,Uttarahalli,3 BHK,1440,2.0,62.00
3,Super built-up Area,Lingadheeranahalli,3 BHK,1521,3.0,95.00
4,Super built-up Area,Kothanur,2 BHK,1200,2.0,51.00

In [157]:
df.isnull().sum()

area_type      0
location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [158]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13320 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   area_type   13320 non-null  object
 1   location    13319 non-null  object
 2   size        13304 non-null  object
 3   total_sqft  13320 non-null  object
 4   bath        13247 non-null  float64
 5   price       13320 non-null  float64
dtypes: float64(2), object(4)
memory usage: 624.5+ KB

In [159]:
df.shape

(13320, 6)

In [160]:
df = df[~df.bath.isnull()]
df.head()

,area_type,location,size,total_sqft,bath,price
0,Super built-up Area,Electronic City Phase II,2 BHK,1056,2.0,39.07
1,Plot Area,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00
2,Built-up Area,Uttarahalli,3 BHK,1440,2.0,62.00
3,Super built-up Area,Lingadheeranahalli,3 BHK,1521,3.0,95.00
4,Super built-up Area,Kothanur,2 BHK,1200,2.0,51.00

In [161]:
df.isnull().sum()

area_type     0
location      1
size          0
total_sqft    0
bath          0
price         0
dtype: int64

In [162]:
df["size"].unique()

array(['2 BHK', '4 Bedroom', '3 BHK', '4 BHK', '6 Bedroom', '3 Bedroom',
       '1 BHK', '1 RK', '1 Bedroom', '8 Bedroom', '2 Bedroom',
       '7 Bedroom', '5 BHK', '7 BHK', '6 BHK', '5 Bedroom', '11 BHK',
       '9 BHK', '9 Bedroom', '27 BHK', '10 Bedroom', '11 Bedroom',
       '10 BHK', '19 BHK', '16 BHK', '43 Bedroom', '14 BHK', '8 BHK',
       '12 Bedroom', '13 BHK', '18 Bedroom'], dtype=object)

In [163]:
l = []
for i in df["size"]:
    a =float(i.split(" ")[0])
    l.append(a)

In [164]:
df["BHK"] = l
df.head()

,area_type,location,size,total_sqft,bath,price,BHK
0,Super built-up Area,Electronic City Phase II,2 BHK,1056,2.0,39.07,2.0
1,Plot Area,Chikka Tirupathi,4 Bedroom,2600,5.0,120.00,4.0
2,Built-up Area,Uttarahalli,3 BHK,1440,2.0,62.00,3.0
3,Super built-up Area,Lingadheeranahalli,3 BHK,1521,3.0,95.00,3.0
4,Super built-up Area,Kothanur,2 BHK,1200,2.0,51.00,2.0

In [165]:
df.drop("size", axis = 1, inplace = True)
df.head()

,area_type,location,total_sqft,bath,price,BHK
0,Super built-up Area,Electronic City Phase II,1056,2.0,39.07,2.0
1,Plot Area,Chikka Tirupathi,2600,5.0,120.00,4.0
2,Built-up Area,Uttarahalli,1440,2.0,62.00,3.0
3,Super built-up Area,Lingadheeranahalli,1521,3.0,95.00,3.0
4,Super built-up Area,Kothanur,1200,2.0,51.00,2.0

In [166]:
df["total_sqft"].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [167]:
def function(x):
    try:
        float(x)
        return float(x)
    except:
        l =  x.split(" - ")
        if len(l) == 2:
            return (float(l[0]) + float(l[1]))/2
        else:
            return None
        return (float(l[0]) + float(l[1]))/2

In [168]:
df["total_sqft"] = df["total_sqft"].apply(function)
df.head()

,area_type,location,total_sqft,bath,price,BHK
0,Super built-up Area,Electronic City Phase II,1056.0,2.0,39.07,2.0
1,Plot Area,Chikka Tirupathi,2600.0,5.0,120.00,4.0
2,Built-up Area,Uttarahalli,1440.0,2.0,62.00,3.0
3,Super built-up Area,Lingadheeranahalli,1521.0,3.0,95.00,3.0
4,Super built-up Area,Kothanur,1200.0,2.0,51.00,2.0

In [169]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13247 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   area_type   13247 non-null  object
 1   location    13246 non-null  object
 2   total_sqft  13201 non-null  float64
 3   bath        13247 non-null  float64
 4   price       13247 non-null  float64
 5   BHK         13247 non-null  float64
dtypes: float64(4), object(2)
memory usage: 724.4+ KB

In [170]:
df = df[~df.total_sqft.isnull()]
df = df[~df.location.isnull()]
df.isnull().sum()

area_type     0
location      0
total_sqft    0
bath          0
price         0
BHK           0
dtype: int64

In [171]:
df.head()

,area_type,location,total_sqft,bath,price,BHK
0,Super built-up Area,Electronic City Phase II,1056.0,2.0,39.07,2.0
1,Plot Area,Chikka Tirupathi,2600.0,5.0,120.00,4.0
2,Built-up Area,Uttarahalli,1440.0,2.0,62.00,3.0
3,Super built-up Area,Lingadheeranahalli,1521.0,3.0,95.00,3.0
4,Super built-up Area,Kothanur,1200.0,2.0,51.00,2.0

In [172]:
df["price_per_sqft"] = (df["price"]*100000)/df["total_sqft"]
df.head()

,area_type,location,total_sqft,bath,price,BHK,price_per_sqft
0,Super built-up Area,Electronic City Phase II,1056.0,2.0,39.07,2.0,3699.810606
1,Plot Area,Chikka Tirupathi,2600.0,5.0,120.00,4.0,4615.384615
2,Built-up Area,Uttarahalli,1440.0,2.0,62.00,3.0,4305.555556
3,Super built-up Area,Lingadheeranahalli,1521.0,3.0,95.00,3.0,6245.890861
4,Super built-up Area,Kothanur,1200.0,2.0,51.00,2.0,4250.000000

In [173]:
df.drop("area_type", axis = 1, inplace = True)
df.head()

                   location  total_sqft  bath   price  BHK  price_per_sqft
0  Electronic City Phase II      1056.0   2.0   39.07  2.0     3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00  4.0     4615.384615
2               Uttarahalli      1440.0   2.0   62.00  3.0     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00  3.0     6245.890861
4                  Kothanur      1200.0   2.0   51.00  2.0     4250.000000

In [174]:
df.location.unique()

array(['Electronic City Phase II', 'Chikka Tirupathi', 'Uttarahalli', ...,
       '12th cross srinivas nagar banshankari 3rd stage',
       'Havanur extension', 'Abshot Layout'], dtype=object)

In [175]:
df["location"] = df["location"].apply(lambda x: str(x))

In [176]:
df["location"] = df["location"].apply(lambda x: x.strip())

In [177]:
df["location"] = df["location"].apply(lambda x: x.capitalize())

In [178]:
len(df.location.unique())

1276

In [179]:
loaction_stats = df.groupby("location")["location"].agg("count").sort_values(ascending = False)
loaction_stats

location
Whitefield             533
Sarjapur  road         392
Electronic city        304
Kanakpura road         264
Thanisandra            235
                      ...
Kamdhenu nagar           1
1 giri nagar             1
Kanakapur main road      1
Kanakapura  rod          1
Zuzuvadi                 1
Name: location, Length: 1276, dtype: int64

In [180]:
less_than_10 = loaction_stats[loaction_stats <= 10]
less_than_10

location
Thyagaraja nagar         10
Sadashiva nagar          10
Dairy circle             10
Btm 1st stage            10
1st block koramangala    10
                         ..
Kamdhenu nagar            1
1 giri nagar              1
Kanakapur main road       1
Kanakapura  rod           1
Zuzuvadi                  1
Name: location, Length: 1036, dtype: int64

In [181]:
df["location"] = df["location"].apply(lambda x: "Others" if x in less_than_10 else x)
df.head()

                   location  total_sqft  bath   price  BHK  price_per_sqft
0  Electronic city phase ii      1056.0   2.0   39.07  2.0     3699.810606
1          Chikka tirupathi      2600.0   5.0  120.00  4.0     4615.384615
2               Uttarahalli      1440.0   2.0   62.00  3.0     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00  3.0     6245.890861
4                  Kothanur      1200.0   2.0   51.00  2.0     4250.000000

In [182]:
df.groupby("location")["location"].agg("count").sort_values(ascending = False)

location
Others             2872
Whitefield          533
Sarjapur  road      392
Electronic city     304
Kanakpura road      264
                   ...
Banjara layout       11
Marsur               11
Bommenahalli         11
Narayanapura         11
Hal 2nd stage        11
Name: location, Length: 241, dtype: int64

In [183]:
df.price_per_sqft.describe()

count    1.320000e+04
mean     7.920759e+03
std      1.067272e+05
min      2.678298e+02
25%      4.267701e+03
50%      5.438331e+03
75%      7.317073e+03
max      1.200000e+07
Name: price_per_sqft, dtype: float64

In [184]:
df1 = df[~((df.total_sqft/df.BHK) < 300)]
df1.head()

                   location  total_sqft  bath   price  BHK  price_per_sqft
0  Electronic city phase ii      1056.0   2.0   39.07  2.0     3699.810606
1          Chikka tirupathi      2600.0   5.0  120.00  4.0     4615.384615
2               Uttarahalli      1440.0   2.0   62.00  3.0     4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00  3.0     6245.890861
4                  Kothanur      1200.0   2.0   51.00  2.0     4250.000000

In [185]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 12456 entries, 0 to 13319
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   location        12456 non-null  object
 1   total_sqft      12456 non-null  float64
 2   bath            12456 non-null  float64
 3   price           12456 non-null  float64
 4   BHK             12456 non-null  float64
 5   price_per_sqft  12456 non-null  float64
dtypes: float64(5), object(1)
memory usage: 681.2+ KB

In [203]:
def remove_pps_outlier(df):
    df_out = pd.DataFrame()
    for keys,subdf in df.groupby("location"):
        m = np.mean(subdf.price_per_sqft)
        s = np.std(subdf.price_per_sqft)
        reduced_df = (subdf[(subdf.price_per_sqft>(m-s)) & (subdf.price_per_sqft<(m+s))])
        df_out = pd.concat([df_out, reduced_df], ignore_index = True)
    return df_out

In [204]:
df2 = remove_pps_outlier(df1)

In [205]:
df2.head()

              location  total_sqft  bath  price  BHK  price_per_sqft
0  1st block jayanagar      2850.0   4.0  428.0  4.0    15017.543860
1  1st block jayanagar      1630.0   3.0  194.0  3.0    11901.840491
2  1st block jayanagar      1875.0   2.0  235.0  3.0    12533.333333
3  1st block jayanagar      1200.0   2.0  130.0  3.0    10833.333333
4  1st block jayanagar      1235.0   2.0  148.0  2.0    11983.805668

In [206]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10242 entries, 0 to 10241
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   location        10242 non-null  object
 1   total_sqft      10242 non-null  float64
 2   bath            10242 non-null  float64
 3   price           10242 non-null  float64
 4   BHK             10242 non-null  float64
 5   price_per_sqft  10242 non-null  float64
dtypes: float64(5), object(1)
memory usage: 480.2+ KB

In [207]:
df2 = pd.get_dummies(data = df , columns = ["location"], drop_first = True)
df2.head()

,total_sqft,bath,price,BHK,price_per_sqft,location_1st phase jp nagar,location_2nd phase judicial layout,location_2nd stage nagarbhavi,location_5th block hbr layout,location_5th phase jp nagar,...,location_Vijayanagar,location_Vishveshwarya layout,location_Vishwapriya layout,location_Vittasandra,location_Whitefield,location_Yelachenahalli,location_Yelahanka,location_Yelahanka new town,location_Yelenahalli,location_Yeshwanthpur
0,1056.0,2.0,39.07,2.0,3699.810606,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,2600.0,5.0,120.00,4.0,4615.384615,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,1440.0,2.0,62.00,3.0,4305.555556,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,1521.0,3.0,95.00,3.0,6245.890861,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,1200.0,2.0,51.00,2.0,4250.000000,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [208]:
from sklearn.preprocessing import MinMaxScaler

In [209]:
scaler = MinMaxScaler()

In [210]:
df2["total_sqft"] = scaler.fit_transform(df2[["total_sqft"]])
df2["bath"] = scaler.fit_transform(df2[["bath"]])
df2["price"] = scaler.fit_transform(df2[["price"]])
df2["BHK"] = scaler.fit_transform(df2[["BHK"]])
df2["price_per_sqft"] = scaler.fit_transform(df2[["price_per_sqft"]])

In [211]:
df2.head()

,total_sqft,bath,price,BHK,price_per_sqft,location_1st phase jp nagar,location_2nd phase judicial layout,location_2nd stage nagarbhavi,location_5th block hbr layout,location_5th phase jp nagar,...,location_Vijayanagar,location_Vishveshwarya layout,location_Vishwapriya layout,location_Vittasandra,location_Whitefield,location_Yelachenahalli,location_Yelahanka,location_Yelahanka new town,location_Yelenahalli,location_Yeshwanthpur
0,0.020183,0.025641,0.008650,0.023810,0.000286,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0.049722,0.102564,0.031180,0.071429,0.000362,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0.027530,0.025641,0.015033,0.047619,0.000336,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0.029079,0.051282,0.024220,0.047619,0.000498,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0.022938,0.025641,0.011971,0.023810,0.000332,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [212]:
X = df2.drop("price", axis = 1)
y = df2.price

In [213]:
from sklearn.model_selection import train_test_split

In [214]:
X_train, X_test, y_train, y_test = train_test_split( X, y, test_size=0.20, random_state=42)

In [215]:
from sklearn.linear_model import LinearRegression

In [216]:
model = LinearRegression()

In [217]:
model.fit(X_train, y_train)

LinearRegression()

In [218]:
model.score(X_test, y_test)

0.5127561270241465